logs/log_find_document_2025-03-24_13-29-55.txt

==== SOAP Request ====
Request Body:
<?xml version='1.0' encoding='UTF-8'?>
        <soapenv:Envelope
            xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
            xmlns:wsa="http://www.w3.org/2005/08/addressing"
            xmlns:query="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0"
            xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0"
            xmlns:rs="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0">
            <soapenv:Header>
                <wsa:To soapenv:mustUnderstand="true">http://localhost:8084/xdstools7.12.0/sim/default__registry01/reg/sq</wsa:To>
                <wsa:MessageID soapenv:mustUnderstand="true">urn:uuid:175709BC017996C4D31741859309458</wsa:MessageID>
                <wsa:Action soapenv:mustUnderstand="true">urn:ihe:iti:2007:RegistryStoredQuery</wsa:Action>
            </soapenv:Header>
            <soapenv:Body>
                <query:AdhocQueryRequest>
                    <query:ResponseOption returnComposedObjects="true" returnType="LeafClass"/>
                    <rim:AdhocQuery id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d">
                        <rim:Slot name="$XDSDocumentEntryPatientId">
                        <rim:ValueList>
                            <rim:Value>{formatted_patient_id}</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>

                    <rim:Slot name="$XDSDocumentEntryType">
                        <rim:ValueList>
                            <rim:Value>('urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1')</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>

                    <rim:Slot name="$XDSDocumentEntryStatus">
                        <rim:ValueList>
                            <rim:Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved')</rim:Value>
                            <rim:Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Deprecated')</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>

                    </rim:AdhocQuery>
                </query:AdhocQueryRequest>
            </soapenv:Body>
        </soapenv:Envelope>
        

==== Response ====
Response Code: 200
Response Body:

<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope">
   <S:Header>
      <wsa:Action s:mustUnderstand="1" xmlns:s="http://www.w3.org/2003/05/soap-envelope"
            xmlns:wsa="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2007:RegistryStoredQueryResponse</wsa:Action>
      <wsa:RelatesTo xmlns:wsa="http://www.w3.org/2005/08/addressing">urn:uuid:175709BC017996C4D31741859309458</wsa:RelatesTo>
   </S:Header>
   <S:Body>
      <query:AdhocQueryResponse status="urn:oasis:names:tc:ebxml-regrep:ResponseStatusType:Failure"
            xmlns:query="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0">
         <rs:RegistryErrorList xmlns:rs="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0">
            <rs:RegistryError codeContext="Could not decode the value {formatted_patient_id}. It does not parse as an integer, a '' delimited string or a () delimited list. Example for parameter $XDSDocumentEntryPatientId is &lt;Value>'c4d77e21d0dd487^^^&amp;1.3.6.1.4.1.21367.2005.3.7&amp;ISO'&lt;/Value>"
                  errorCode="XDSRegistryError" location="QueryRequestMessageValidator"
                  severity="urn:oasis:names:tc:ebxml-regrep:ErrorSeverityType:Error"/>
            <rs:RegistryError codeContext="Could not decode the value {formatted_patient_id}. It does not parse as an integer, a '' delimited string or a () delimited list. Example for parameter $XDSDocumentEntryPatientId is &lt;Value>'c4d77e21d0dd487^^^&amp;1.3.6.1.4.1.21367.2005.3.7&amp;ISO'&lt;/Value>"
                  errorCode="XDSRegistryError" location="QueryRequestMessageValidator"
                  severity="urn:oasis:names:tc:ebxml-regrep:ErrorSeverityType:Error"/>
         </rs:RegistryErrorList>
         <rim:RegistryObjectList xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0"/>
      </query:AdhocQueryResponse>
   </S:Body>
</S:Envelope>
